/**
 * Created by caojie on 17-8-28.
 */
window.randname = ['见山','人间朝暮','孤独入客枕','雾锁深情目','妄饮晩冬酒','轻枕海棠','遥寄三山','逃夭','君踏桃花归','眼底桃花色','山河有幸埋战骨','三千妖杀','执伞青衣袖','闯入君怀','醉风吹客衣','饮马桃花时','春色三分','独钓一江月','偏作相思骨','春慵','倚楼听雨','西风乍起','纵花期将误','漫思茶','杯酒困英雄','桃腮带笑','世事堪玩味','此心却寄予','泸沽烟水里的过客','相思劫','门前流水尚能西','自轻舟去','清茶白事欢','若水三千','十八闲客','饮尽盏中余温','让笑意折了枝','山水几程远','北渚','蜀三川','执笔画素颜','写雾词','眉间意难了','書生敬亭山','雲胡不喜','浑似梦中客','平你眉间川','青烟小生','白裙红衣的姑娘','独行千万里','沧桑稚子','    媲美巫婆','九月遗忘所有','等①個旧亾','终会忘记℡','一枝柳，换你一滴英雄泪','霜雪落满头','缪败','对镜梳妆〆回忆惘然','┈紅丬ぜρёι姑孃┈','他是她的无可替代','┌_風祌僀涙','爱哭的小孩','霸道小男人ゞ','来日方长','超污;小萌神.','灬落寞街頭','随他吧','聆听、心跳dē镟嵂','ㄗs戰聖じ','素颜朝天我走街','患者','归遇','林间抚琴者','醉眼望云烟','且将青衫换酒','城南诗客','鸩远一方','提灯晚风','酒意入桃枝','花重月数','白衣酒客','着素衣','酒醒梦迟','拔剑斷情伤','云裳佳人','细呷温酒','君未叹沉香','素酒青衣贤','素手披薄衣','风乎舞雩','南冥有猫','长虹饮涧','春风不识路','眉梢眼角藏欢','一盅浊酒醉方休','南溟大人','茕茕白兔','单衫杏子红','入云栖','卧笑醉伊人','红鸾心动','诗酒露华浓','歌散酒初醒','娇女轻抚琴','抚琴绘长歌','川长思鸟来','窈窕君王妻','何如旧颜','醉卧君子膝','折花载酒少年事','眸是三千嗔','美人轻蔑寡人殇！','画扇浅醉染一袭','古城小巷红尘客','西阁的酒','遗城落梦Ω','斟满千杯思','峥嵘岁月长','南山相送','困酣娇眼','鱼雁音书','且共从容','沽酒待人歸','千秋岁','轻拂两袖风尘','蒹葭烫酒','十里长街走马','临风纵欢','酒肆饮几壶','袖ロ生香','青笺画卿颜','青丝挽来生','素衣清颜淡若尘','卿如绿萼','长欢久安','与君醉笑三千场','苍笙踏歌','酒醒梦断','    明月风清','放手也是⒈种爱','吃货姑娘最可爱','有本事你咬我啊、','幻紫','〃多情女子，红颜薄命','捧在手心的挚爱。','Tsundere','帅的不敢上厕所','帅炸了','沧海桑田 海阔天空','鉨瞞着所囿亾，爱着誰','不悔此生种深情','々夏小主','Ⅱ╮ 烟绡弥漫在空中','口味情话','¤永遠的孌情¤','我为自己带盐i','南風ьει漂ヽ','想念汇集成河','爾比花還美丶','O奈~','初见与别辞','弦上清辉霜满弧','谢却荼蘼','吾性傲以野','雁素鱼笺','山月不知心底事','只须若为只须君','几许温柔佐酒','余墨残香独自敛','清酒孤欢','相思寄','伴君幽独','戎马安半生','清白小生','韶华洗泪妆','沽酒问卿','浊酒倾觞','青山独归远','江船夜雨听笛','满怀离愁饮','风送渔人到岸','帘卷笙声寂','三寸画锁骨','拟墨画扇','秦桑低绿枝','妙手青丝花前绣','橘落淮南终成枳','料峭春风吹酒醒','醉笑红尘千场','落花人独立','予醉伴花眠','散发膝间对饮酒','明我长相忆','半生輕狂客','几许相思待酒浇','ぃ暮风古榕待人歸','春怀似酒浓','云中寄锦书','挥袂客天涯','淳曲佳人难诉衷肠','对此欢终宴','白露饮尘霜','一曲思君赋','识遍英雄路','我醉欲眠','浊酒杯醉人不醉','为君司南','晚来天欲雪','虎行風捷猎','忍写断肠句','檐底铃声','倾酒向涟漪','京华倦客','狂歌痛饮','眉目艳新月','拢一蓑烟雨','红装而蹇者','朗月清风','长恨春归晚','置酒而臥','清歌花酒','语隔秋烟','低吟归去兮','浪花有意','朝歌夜弦','伴君跳出红尘外','    天有你喜欢的蓝色','你以为深爱i','煙花易冷╮','没功能就别说操','◢▂栐遠锝愢唸▂◣','Moon、凄暗丶','△柠檬之夏','HaDean丨名流','笑看、红颜','那谁，我看上你了','tell me what to be',' 姐很高、也很傲╰つ','亡心&','皆叹','只能是个梦ζ','多情又炙热','慾朢養厲鬼’の','吻舞双全丶','山河有幸埋战骨','没差i','涛姐是女神','面无表情的爱着你','花边载酒','青山隐隐','莫辞酒味薄','声声慢','淫词浪曲','眉目不掩笑意','多情易老ヽ','灬狂酲易醒','望断江南岸','肆酒娼','卿以君歌','花骨埋香','寒玉簪秋水','斯人独醉','枝上绵蛮','细看秦筝','沉醉不知归路','嗟我怀人','蓦地一相逢','画角声中','羁旅长堪醉','吹皱一池春水','取苍穹一隅','朝飞暮卷','空水漫漫','翻恨游丝短','潇洒出风尘','是离愁','听闻君莫笑','离恨悠悠','一笠烟雨','空水漫漫','旧故里草木深','伯人心贤','醉里几时欢','沽酒杯空影','清风可相许','放浪江湖','醉饮千觞不知愁','离人犹未归','望君铭记妾容颜','叶散冰离','幸而勿忘矣','来往不逢人','酒阑人散','白衣渡川','山有扶苏','风劲角弓鸣','开到荼靡','青梅佐以酒','浪子提剑江湖走','更吹落、星如雨','未若柳絮','无情有思','歌尽酒','强乐还无味','朱明承夜','风烟倦','古亭白衫少年殇','明朝千里别','微雨打梨花灬','公子姓甚名谁家住何处','羡鱼','蒹葭青衫','清扬婉兮','庸人自庸','    污开了花','海·的声音','谢谢你给的爱。','_煙酒縱慾☆','╲_/袹迣鯖','尘。','碧海蓝天婚纱地！','古靈精怪_/↘','ァ離别煙火何以浪漫О','我爱你就像老鼠爱大米','所剩無幾かde驕傲','温唇°sunshine','丶唯y1的执着','埖様мeì男Ζīぺ','寻一个拥抱','我女儿她妈很萌','不欢而散i','醉后余欢。','笙歌欢颜','贱妾梦瓖见吾君°','音桀','[ 童话被染上伤 ]','清狂','半江戎马与君筹','笙尽缘无','仗剑行诗者','夏醉浅梦','绾发思君','与君长诀','疏狂几曾','词抒笙歌','劝君莫执意','半卷清词','笙歌君独幽','清水漪澜','煑揂壹鬥','一寸光阴，半亩情','美如冠玉','山抹微云','一别两宽，各生欢喜','良辰不负美景','心之忧已，於我归息','醉眼不逢人','无处寄笺','一纸红笺','拟歌先敛，欲笑还颦','良辰','眉眼一袭温良','红袖添香','青衣水袖','阑珊几场','故人难聚','左语','孤存','踽踽独行','棠梨煎雪','独酌陈酿','明月下西楼','予之笑颜','荖葙恏','侠骨柔情摧红颜','清宵尚温','场以散，故人亦相离','画唐轻赋临江仙','卮言','笙歌欢颜','谏书稀','美人迟暮','笙歌醉梦间℃','挽歌渐起','笙歌已沫','山穷水尽更词穷','十夏九黎','明月多情应笑我','┌;亦旧怡心','笙歌歇尽','←琴默千弦︶','君生我未生','此情可待追忆','浪与矜持','诉清风','天下皆白，唯我独黑','清夜深林觅故人','回首寒暄','旧年素颜、君记否','堇年_伊人倾城','白衫故人','梦里归人','    奢求不来的爱','ミ﹏心以被傷','⒐缺αn稳づ','没个正样¨','思初念','knapweed','村姑也狠潮丶','巴黎雪ˋ东京泪','*.﹌未知の未涞◆','Christina –','寳鋇ル微笑','深巷凉街','钱男友！','我拼了命爱ヤ你拼了命躲','格式化丶過去','刺痛 ＼的 傷','请把我们的过去╰格式化','看透你！','不熟悉的你','欲奴','ゾ独奏','呐段挽回不了的情。'];
function ss(n) {
    return Math.ceil(Math.random()*n)
}
$(document).ready(function(){
    // $("input[name=uname]").val(window.randname[ss(424)]);
    if( "女" == window.sex) {
        $($("input[name=sex]")[1]).prop("checked","true");
    }else{
        $($("input[name=sex]")[0]).prop("checked","true");
    }
    var mrysts = $("input[name=mryst]");
    for( var i=0;i<mrysts.length;i++ ) {
        if( mrysts[i].value == $($(".uinfo span")[1]).text() ) {
            $(mrysts[i]).prop("checked","true");
        }
    }
})

function save(){
    var uname = $("input[name=uname]").val();
    var sex = $("input[name=sex]:checked").val();
    var age = $("input[name=age]").val();
    var intro = $("textarea[name=intro]").val();
    var mryst = $("input[name=mryst]:checked").val();
    var addr = $("input[name=addr]").val();

    if( age != '' && !/^[1-9]{1}\d{1}$/.test(age) ) {
        toast("请填写正确的年龄,例如：23 , 34"); return ;
    }
    $.post("/updateuserinfo",{
        "uname":uname,"sex":sex,"age":age,"intro":intro,"mryst":mryst,"addr":addr
    },function(data){
        var d = ajaxdata(data);
        if( d ) {
            toast("更新成功");
            location.reload();
        }
    })
}

function updatehead(that) {
    var file = that.files[0];
    if( checkFileAllow(file,"image",3) ) {
        var fd = new FormData();
        fd.append("file" , file );
        var oXHR = new XMLHttpRequest();
        oXHR.open('POST', "/updatehead");
        oXHR.onreadystatechange = function() {
            if (oXHR.readyState == 4 && oXHR.status == 200) {
                var d = oXHR.responseText; // 返回值
                if( ajaxdata(d) ) {
                    location.reload();
                }
            }
        }
        oXHR.send(fd);
    }
}